<?xml version="1.0"?>
<dataset id="qald-5_train">

<query id="2">
<keyword_query lang="en"><![CDATA[German cities with more than 250000 inhabitants]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
         ?uri type GermanCities .  
         ?uri inhabitants ?inhabitants . 
         FILTER ( ?inhabitants > 250000 ) } 
]]></schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
       { ?uri rdf:type dbo:City . } 
       UNION 
       { ?uri rdf:type dbo:Town . } 
         ?uri dbo:country res:Germany . 
         ?uri dbo:populationTotal ?population . 
         FILTER ( ?population > 250000 ) } 
]]></resolved_query>
<answers><answer>http://dbpedia.org/resource/Braunschweig</answer><answer>http://dbpedia.org/resource/Dresden</answer><answer>http://dbpedia.org/resource/Wuppertal</answer><answer>http://dbpedia.org/resource/Bonn</answer><answer>http://dbpedia.org/resource/Cologne</answer><answer>http://dbpedia.org/resource/Frankfurt</answer><answer>http://dbpedia.org/resource/Hamburg</answer><answer>http://dbpedia.org/resource/Hanover</answer><answer>http://dbpedia.org/resource/Munich</answer><answer>http://dbpedia.org/resource/Nuremberg</answer><answer>http://dbpedia.org/resource/Duisburg</answer><answer>http://dbpedia.org/resource/Bielefeld</answer><answer>http://dbpedia.org/resource/Bochum</answer><answer>http://dbpedia.org/resource/Essen</answer><answer>http://dbpedia.org/resource/Gelsenkirchen</answer><answer>http://dbpedia.org/resource/M%C3%B6nchengladbach</answer><answer>http://dbpedia.org/resource/Augsburg</answer><answer>http://dbpedia.org/resource/Wiesbaden</answer><answer>http://dbpedia.org/resource/Aachen</answer><answer>http://dbpedia.org/resource/Leipzig</answer><answer>http://dbpedia.org/resource/Stuttgart</answer><answer>http://dbpedia.org/resource/Karlsruhe</answer><answer>http://dbpedia.org/resource/Mannheim</answer><answer>http://dbpedia.org/resource/Bremen</answer></answers></query>

<query id="3">
<keyword_query lang="en"><![CDATA[mayor of Berlin]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
      ?uri mayorOf Berlin . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Berlin dbo:leader ?uri . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Klaus_Wowereit</answer></answers></query>

<query id="4">
<keyword_query lang="en"><![CDATA[second highest mountain on Earth]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
		?uri locatedOn Earth .
        ?uri type Mountain . 
        ?uri height ?height . 
} 
ORDER BY DESC(?height) 
OFFSET 1 LIMIT 1 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Mountain . 
        ?uri dbo:elevation ?elevation . 
} 
ORDER BY DESC(?elevation) 
OFFSET 1 LIMIT 1 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/K2</answer></answers></query>

<query id="5">
<keyword_query lang="en"><![CDATA[professional skateboarders from Sweden]]></keyword_query>
<schema_agnostic_query><![CDATA[ 

SELECT DISTINCT ?uri 
WHERE { 
       ?uri type ProfessionalSkateboarders . 
       ?uri nationality Sweden .
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Skateboarding . 
      { ?uri dbo:birthPlace res:Sweden . } 
      UNION 
      { ?uri dbo:birthPlace ?place . 
        ?place dbo:country res:Sweden . } 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Ali_Boulala</answer><answer>http://dbpedia.org/resource/Tony_Magnusson</answer></answers></query>

<query id="6">
<keyword_query lang="en"><![CDATA[band leaders that play trumpet]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Bandleader . 
        ?uri play Trumpet . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Bandleader . 
        ?uri dbo:instrument res:Trumpet . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Richard_Maltby,_Sr.</answer><answer>http://dbpedia.org/resource/Vic_Schoen</answer><answer>http://dbpedia.org/resource/Pete_Brown_(jazz_musician)</answer><answer>http://dbpedia.org/resource/W._C._Handy</answer><answer>http://dbpedia.org/resource/Jack_Jackson_(British_radio)</answer><answer>http://dbpedia.org/resource/Louis_Prima,_Jr.</answer><answer>http://dbpedia.org/resource/Ernest_%22Doc%22_Paulin</answer><answer>http://dbpedia.org/resource/George_Colligan</answer><answer>http://dbpedia.org/resource/Louis_Prima</answer><answer>http://dbpedia.org/resource/David_Weiss_(musician)</answer><answer>http://dbpedia.org/resource/Joe_Morris_(trumpeter)</answer><answer>http://dbpedia.org/resource/Hot_Lips_Page</answer><answer>http://dbpedia.org/resource/Erik_Truffaz</answer><answer>http://dbpedia.org/resource/Neil_Yates</answer><answer>http://dbpedia.org/resource/Henry_Jerome</answer><answer>http://dbpedia.org/resource/Hugh_Masekela</answer><answer>http://dbpedia.org/resource/Maynard_Ferguson</answer><answer>http://dbpedia.org/resource/Nick_LaRocca</answer><answer>http://dbpedia.org/resource/Tommy_Dorsey</answer><answer>http://dbpedia.org/resource/Wingy_Manone</answer><answer>http://dbpedia.org/resource/Orbert_Davis</answer><answer>http://dbpedia.org/resource/Joey_DeFrancesco</answer><answer>http://dbpedia.org/resource/Cleveland_Eaton</answer><answer>http://dbpedia.org/resource/Don_Albert</answer><answer>http://dbpedia.org/resource/Clifford_Thornton</answer><answer>http://dbpedia.org/resource/Ollie_Mitchell</answer><answer>http://dbpedia.org/resource/Ovie_Alston</answer><answer>http://dbpedia.org/resource/Al_Hirt</answer><answer>http://dbpedia.org/resource/Jimmy_Dorsey</answer><answer>http://dbpedia.org/resource/Sharkey_Bonano</answer><answer>http://dbpedia.org/resource/Dave_Douglas_(trumpeter)</answer><answer>http://dbpedia.org/resource/Willie_Mitchell_(musician)</answer><answer>http://dbpedia.org/resource/Charlie_Spivak</answer><answer>http://dbpedia.org/resource/Mark_Egan</answer><answer>http://dbpedia.org/resource/Joe_Wilder</answer><answer>http://dbpedia.org/resource/Benny_Carter</answer><answer>http://dbpedia.org/resource/Doc_Severinsen</answer><answer>http://dbpedia.org/resource/Freddie_Hubbard</answer><answer>http://dbpedia.org/resource/Kenny_Dorham</answer><answer>http://dbpedia.org/resource/Doc_Cheatham</answer><answer>http://dbpedia.org/resource/Nat_Gonella</answer><answer>http://dbpedia.org/resource/Gerard_Presencer</answer><answer>http://dbpedia.org/resource/Jimmy_Vivino</answer><answer>http://dbpedia.org/resource/Kenny_Ball</answer><answer>http://dbpedia.org/resource/Farnell_Newton</answer><answer>http://dbpedia.org/resource/Red_Perkins</answer><answer>http://dbpedia.org/resource/Theodore_Carpenter</answer><answer>http://dbpedia.org/resource/Alan_Silva</answer><answer>http://dbpedia.org/resource/Irvin_Mayfield</answer><answer>http://dbpedia.org/resource/Jens_Winther</answer><answer>http://dbpedia.org/resource/Danny_Davis_(country_musician)</answer><answer>http://dbpedia.org/resource/Rufus_Reid</answer><answer>http://dbpedia.org/resource/Dave_Bartholomew</answer><answer>http://dbpedia.org/resource/Avishai_Cohen_(trumpeter)</answer><answer>http://dbpedia.org/resource/Jack_Walrath</answer><answer>http://dbpedia.org/resource/Marlon_Jordan</answer><answer>http://dbpedia.org/resource/Theo_Croker</answer><answer>http://dbpedia.org/resource/Bobby_Hackett</answer><answer>http://dbpedia.org/resource/Gerald_Wilson</answer><answer>http://dbpedia.org/resource/Terumasa_Hino</answer><answer>http://dbpedia.org/resource/Sean_Jones_(trumpeter)</answer><answer>http://dbpedia.org/resource/Abatte_Barihun</answer><answer>http://dbpedia.org/resource/Billie_Rogers</answer><answer>http://dbpedia.org/resource/Woody_Shaw</answer><answer>http://dbpedia.org/resource/Papa_Celestin</answer><answer>http://dbpedia.org/resource/Lloyd_Hunter</answer><answer>http://dbpedia.org/resource/Guy_Barker</answer><answer>http://dbpedia.org/resource/Dominick_Farinacci</answer><answer>http://dbpedia.org/resource/Brad_Turner_(musician)</answer></answers></query>

<query id="7">
<keyword_query lang="en"><![CDATA[countries have more than ten caves]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Country .
		?uri has ?cave .
        ?cave type Cave . 
} 
GROUP BY ?uri 
HAVING(COUNT(?cave) > 10) 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Country . 
        ?cave rdf:type dbo:Cave . 
      { ?cave dbo:location ?uri . } 
      UNION 
      { ?cave dbo:location ?loc . 
        ?loc dbo:country ?uri . } 
} 
GROUP BY ?uri 
HAVING(COUNT(?cave) > 10) 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/China</answer><answer>http://dbpedia.org/resource/England</answer><answer>http://dbpedia.org/resource/India</answer><answer>http://dbpedia.org/resource/Republic_of_Ireland</answer><answer>http://dbpedia.org/resource/Wales</answer><answer>http://dbpedia.org/resource/Mexico</answer><answer>http://dbpedia.org/resource/United_Kingdom</answer><answer>http://dbpedia.org/resource/Italy</answer><answer>http://dbpedia.org/resource/Jamaica</answer><answer>http://dbpedia.org/resource/United_States</answer><answer>http://dbpedia.org/resource/Gibraltar</answer></answers></query>

<query id="8">
<keyword_query lang="en"><![CDATA[Formula 1 driver with the most races]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Formula1Driver . 
        ?uri numberOfRaces ?x . 
} 
ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:FormulaOneRacer . 
        ?uri dbo:races ?x . 
} 
ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Rubens_Barrichello</answer></answers></query>

<query id="9">
<keyword_query lang="en"><![CDATA[youngest player in the Premier League]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Player . 
        ?uri playsAt PremierLeague . 
        ?uri birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:team ?x . 
        ?x dbo:league res:Premier_League . 
        ?uri dbo:birthDate ?y . 
} 
ORDER BY DESC(?y) 
OFFSET 0 LIMIT 1 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Ernie_Pinkney</answer></answers></query>

<query id="10">
<keyword_query lang="en"><![CDATA[longest river]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
       ?uri type River . 
       ?uri length ?l . 
} 
ORDER BY DESC(?l) 
OFFSET 0 LIMIT 1 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:River . 
      { ?uri dbo:length ?l . } 
      UNION 
      { ?uri dbp:length ?l . } 
} 
ORDER BY DESC(?l) 
OFFSET 0 LIMIT 1 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Lochbach_(Itter)</answer></answers></query>

<query id="12">
<keyword_query lang="en"><![CDATA[People that were born in Vienna and died in Berlin]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
		?uri type Person .
        ?uri bornIn Vienna . 
        ?uri diedIn Berlin . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:birthPlace res:Vienna . 
        ?uri dbo:deathPlace res:Berlin . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Alfred_Halm</answer><answer>http://dbpedia.org/resource/Richard_Thurnwald</answer><answer>http://dbpedia.org/resource/Grete_von_Zieritz</answer><answer>http://dbpedia.org/resource/Eduard_von_Winterstein</answer><answer>http://dbpedia.org/resource/Karl_Hellmer</answer><answer>http://dbpedia.org/resource/Hilde_K%C3%B6rber</answer><answer>http://dbpedia.org/resource/Adolf_Klein</answer><answer>http://dbpedia.org/resource/Michael_von_Newlinsky</answer><answer>http://dbpedia.org/resource/Hugo_Flink</answer><answer>http://dbpedia.org/resource/Erik_Jan_Hanussen</answer><answer>http://dbpedia.org/resource/Therese_Gr%C3%BCnbaum</answer><answer>http://dbpedia.org/resource/Karl_Etlinger</answer><answer>http://dbpedia.org/resource/Steffie_Spira</answer></answers></query>

<query id="13">
<keyword_query lang="en"><![CDATA[Mother and father of Prince Harry and Prince William ]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT ?father ?mother
WHERE { 
        Prince_William hasFather ?father . 
        Prince_Harry hasFather ?father .
		Prince_William hasMother ?mother . 
        Prince_Harry hasMother ?mother .
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
SELECT ?x
WHERE { 
        <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> dbo:parent ?x . 
        <http://dbpedia.org/resource/Prince_Harry> dbo:parent ?x .
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Diana,_Princess_of_Wales</answer><answer>http://dbpedia.org/resource/Charles,_Princess_of_Wales</answer></answers></query>

<query id="14">
<keyword_query lang="en"><![CDATA[latest U.S. state admitted]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type US_State . 
        ?uri admittedAt ?x . 
} ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX yago: <http://dbpedia.org/class/yago/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type yago:StatesOfTheUnitedStates . 
        ?uri dbp:admittancedate ?x . 
} ORDER BY DESC(?x) 
OFFSET 0 LIMIT 1 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Hawaii</answer></answers></query>

<query id="15">
<keyword_query lang="en"><![CDATA[number of languages spoken in Turkmenistan]]></keyword_query>

<schema_agnostic_query><![CDATA[ 
SELECT COUNT(DISTINCT ?x)
WHERE { 
		?x type Language .
		?x spokenIn Turkmenistan .
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?x) 
WHERE { 
        res:Turkmenistan dbo:language ?x . 
} 
]]>
</resolved_query>
<answers><answer>2</answer></answers></query>

<query id="16">
<keyword_query lang="en"><![CDATA[movies directed by Francis Ford Coppola]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Movie . 
        ?uri directedBy Francis_Ford_Coppola . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Film . 
        ?uri dbo:director res:Francis_Ford_Coppola . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Hammett_(film)</answer><answer>http://dbpedia.org/resource/The_Rain_People</answer><answer>http://dbpedia.org/resource/Twixt_(film)</answer><answer>http://dbpedia.org/resource/The_Conversation</answer><answer>http://dbpedia.org/resource/The_Godfather_Part_II</answer><answer>http://dbpedia.org/resource/The_Godfather_Part_III</answer><answer>http://dbpedia.org/resource/The_Terror_(1963_film)</answer><answer>http://dbpedia.org/resource/The_Cotton_Club_(film)</answer><answer>http://dbpedia.org/resource/The_Rainmaker_(1997_film)</answer><answer>http://dbpedia.org/resource/Apocalypse_Now</answer><answer>http://dbpedia.org/resource/Dementia_13</answer><answer>http://dbpedia.org/resource/Tucker:_The_Man_and_His_Dream</answer><answer>http://dbpedia.org/resource/Tonight_for_Sure</answer><answer>http://dbpedia.org/resource/The_Bellboy_and_the_Playgirls</answer><answer>http://dbpedia.org/resource/Peggy_Sue_Got_Married</answer><answer>http://dbpedia.org/resource/Bram_Stoker's_Dracula</answer><answer>http://dbpedia.org/resource/Battle_Beyond_the_Sun</answer><answer>http://dbpedia.org/resource/Gardens_of_Stone</answer><answer>http://dbpedia.org/resource/Rumble_Fish</answer><answer>http://dbpedia.org/resource/You're_a_Big_Boy_Now</answer><answer>http://dbpedia.org/resource/Jack_(1996_film)</answer><answer>http://dbpedia.org/resource/The_Godfather</answer><answer>http://dbpedia.org/resource/The_Godfather_(film_series)</answer><answer>http://dbpedia.org/resource/The_Godfather_Saga</answer><answer>http://dbpedia.org/resource/Tetro</answer><answer>http://dbpedia.org/resource/The_Outsiders_(film)</answer><answer>http://dbpedia.org/resource/Youth_Without_Youth_(film)</answer><answer>http://dbpedia.org/resource/One_from_the_Heart</answer><answer>http://dbpedia.org/resource/Apocalypse_Now_Redux</answer><answer>http://dbpedia.org/resource/New_York_Stories</answer></answers></query>

<query id="17">
<keyword_query lang="en"><![CDATA[maiden name of Angela Merkel]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?string 
WHERE { 
        Angela_Merkel maidenName ?string . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?string 
WHERE { 
        res:Angela_Merkel dbp:birthName ?string . 
} 
]]>
</resolved_query>
<answers><answer>Angela Dorothea Kasner</answer></answers></query>

<query id="18">
<keyword_query lang="en"><![CDATA[Methodist politicians]]></keyword_query>

<query id="19">
<keyword_query lang="en"><![CDATA[number of times that Jane Fonda married]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        Jane_Fonda marriedTo ?uri . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT COUNT(DISTINCT ?uri) 
WHERE { 
        res:Jane_Fonda dbo:spouse ?uri . 
} 
]]>
</resolved_query>
<answers><answer>3</answer></answers></query>

<query id="20">
<keyword_query lang="en"><![CDATA[Australian nonprofit organizations]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type NonprofitOrganization . 
        ?uri country Australia . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:type res:Nonprofit_organization . 
      { ?uri dbo:locationCountry res:Australia . } 
      UNION 
      { ?uri dbo:location ?x . 
        ?x dbo:country res:Australia . } 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/The_Conversation_(website)</answer><answer>http://dbpedia.org/resource/YourView</answer><answer>http://dbpedia.org/resource/Arc_@_UNSW_Limited</answer><answer>http://dbpedia.org/resource/The_Co-op_Bookshop</answer><answer>http://dbpedia.org/resource/Aboriginal_Literacy_Foundation</answer><answer>http://dbpedia.org/resource/Cooperative_Research_Centre_for_Advanced_Composite_Structures</answer><answer>http://dbpedia.org/resource/Fair_Trade_Association_of_Australia_and_New_Zealand</answer><answer>http://dbpedia.org/resource/Victorian_Employers'_Chamber_of_Commerce_and_Industry</answer><answer>http://dbpedia.org/resource/Australia_21</answer><answer>http://dbpedia.org/resource/Forum_for_European%E2%80%93Australian_Science_and_Technology_Cooperation</answer><answer>http://dbpedia.org/resource/National_Science_Summer_School_Inc.</answer><answer>http://dbpedia.org/resource/National_Youth_Science_Forum</answer><answer>http://dbpedia.org/resource/Snow_Foundation</answer><answer>http://dbpedia.org/resource/GMHBA_Limited</answer><answer>http://dbpedia.org/resource/Sustainable_Tourism_CRC</answer><answer>http://dbpedia.org/resource/Outward_Bound_Australia</answer><answer>http://dbpedia.org/resource/Poultry_CRC</answer><answer>http://dbpedia.org/resource/LIXI</answer><answer>http://dbpedia.org/resource/Currency_House</answer><answer>http://dbpedia.org/resource/HBF_Health_Fund</answer></answers></query>

<query id="21">
<keyword_query lang="en"><![CDATA[Military conflicts in which Lawrence of Arabia participated]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        Lawrence_of_Arabia militaryConflicts ?uri . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:T._E._Lawrence dbo:battle ?uri . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Capture_of_Damascus_(1918)</answer><answer>http://dbpedia.org/resource/Arab_Revolt</answer><answer>http://dbpedia.org/resource/Battle_of_Megiddo_(1918)</answer><answer>http://dbpedia.org/resource/World_War_I</answer><answer>http://dbpedia.org/resource/Battle_of_Aqaba</answer><answer>http://dbpedia.org/resource/Siege_of_Medina</answer><answer>http://dbpedia.org/resource/Battle_of_Aba_el_Lissan</answer><answer>http://dbpedia.org/resource/Battle_of_Deraa</answer><answer>http://dbpedia.org/resource/Battle_of_Fwelia</answer><answer>http://dbpedia.org/resource/Battle_of_Talifeh</answer></answers></query>

<query id="22">
<keyword_query lang="en"><![CDATA[number of inhabitants in Maribor]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?num 
WHERE { 
        Maribor numberOfInhabitants ?num . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?num 
WHERE { 
        res:Maribor dbo:populationTotal ?num . 
} 
]]>
</resolved_query>
<answers><answer>114487</answer></answers></query>

<query id="24">
<keyword_query lang="en"><![CDATA[games developed by GMT]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Games . 
        ?uri developedBy GMT . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:publisher res:GMT_Games . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Fields_of_Fire_(game)</answer><answer>http://dbpedia.org/resource/Commands_&amp;_Colors:_Ancients</answer><answer>http://dbpedia.org/resource/Chandragupta_(board_game)</answer><answer>http://dbpedia.org/resource/Sword_of_Rome</answer><answer>http://dbpedia.org/resource/Paths_of_Glory_(board_game)</answer><answer>http://dbpedia.org/resource/Washington's_War</answer><answer>http://dbpedia.org/resource/Twilight_Struggle</answer></answers></query>

<query id="25">
<keyword_query lang="en"><![CDATA[husband of Amanda Palmer]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri husbandOf Amanda_Palmer . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Amanda_Palmer dbp:spouse ?uri . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Neil_Gaiman</answer></answers></query>

<query id="26">
<keyword_query lang="en"><![CDATA[countries connected by the Rhine]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Country .
		?uri hasRiver Rhine .		
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Rhine dbp:country ?string .  
        ?uri rdf:type dbo:Country .  
        ?uri rdfs:label ?string . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Germany</answer><answer>http://dbpedia.org/resource/Liechtenstein</answer><answer>http://dbpedia.org/resource/Netherlands</answer><answer>http://dbpedia.org/resource/Switzerland</answer><answer>http://dbpedia.org/resource/Austria</answer><answer>http://dbpedia.org/resource/France</answer></answers></query>

<query id="27">
<keyword_query lang="en"><![CDATA[professional surfers born in Australia]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type ProfessionalSurfers .  
        ?uri bornIn Australia .  
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
       { ?uri dbo:birthPlace res:Australia . }
       UNION 
       { ?uri dbo:birthPlace ?x . 
         ?x dbo:country res:Australia . }
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Midget_Farrelly</answer><answer>http://dbpedia.org/resource/Ian_Cairns</answer><answer>http://dbpedia.org/resource/Koby_Abberton</answer></answers></query>

<query id="28">
<keyword_query lang="en"><![CDATA[islands that belong to Japan]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Island .  
        ?uri belongTo Japan . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:Island .  
        ?uri dbo:country res:Japan . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Kume_Island</answer><answer>http://dbpedia.org/resource/Honshu</answer><answer>http://dbpedia.org/resource/Shikoku</answer><answer>http://dbpedia.org/resource/Rishiri_Island</answer><answer>http://dbpedia.org/resource/Yagishiri_Island</answer><answer>http://dbpedia.org/resource/Akusekijima</answer><answer>http://dbpedia.org/resource/Gajajima</answer><answer>http://dbpedia.org/resource/Kogajajima</answer><answer>http://dbpedia.org/resource/Mageshima</answer><answer>http://dbpedia.org/resource/Takeshima_(Kagoshima)</answer><answer>http://dbpedia.org/resource/Kyushu</answer><answer>http://dbpedia.org/resource/Zamami_Island</answer><answer>http://dbpedia.org/resource/Izena_Island</answer><answer>http://dbpedia.org/resource/%C5%8Cnohara_Islands</answer><answer>http://dbpedia.org/resource/%C5%8Csumi_Islands</answer><answer>http://dbpedia.org/resource/Iki_Island</answer><answer>http://dbpedia.org/resource/Tori-shima_(Izu_Islands)</answer><answer>http://dbpedia.org/resource/Yonaguni</answer><answer>http://dbpedia.org/resource/Iwo_Jima</answer><answer>http://dbpedia.org/resource/Aka_Island</answer><answer>http://dbpedia.org/resource/Ishigaki_Island</answer><answer>http://dbpedia.org/resource/Tairajima</answer><answer>http://dbpedia.org/resource/Teuri_Island</answer><answer>http://dbpedia.org/resource/Tokara_Islands</answer><answer>http://dbpedia.org/resource/Minami-Tori-shima</answer><answer>http://dbpedia.org/resource/Yaeyama_Islands</answer><answer>http://dbpedia.org/resource/Minamidait%C5%8Djima</answer><answer>http://dbpedia.org/resource/Okinawa_Island</answer><answer>http://dbpedia.org/resource/Iriomote-jima</answer><answer>http://dbpedia.org/resource/Taketomi_Island</answer><answer>http://dbpedia.org/resource/Kitadait%C5%8Djima</answer><answer>http://dbpedia.org/resource/Bayonnaise_Rocks</answer><answer>http://dbpedia.org/resource/Tanegashima</answer><answer>http://dbpedia.org/resource/Yakushima</answer><answer>http://dbpedia.org/resource/Okinotorishima</answer><answer>http://dbpedia.org/resource/Hateruma</answer><answer>http://dbpedia.org/resource/Geruma_Island</answer><answer>http://dbpedia.org/resource/Nakanoshima_(Kagoshima)</answer><answer>http://dbpedia.org/resource/Inamba-jima</answer><answer>http://dbpedia.org/resource/Fukaji_Island</answer><answer>http://dbpedia.org/resource/Tobishima_(Yamagata)</answer><answer>http://dbpedia.org/resource/Awaji_Island</answer><answer>http://dbpedia.org/resource/Oki_Islands</answer><answer>http://dbpedia.org/resource/Tsushima_Island</answer><answer>http://dbpedia.org/resource/Kuchinoerabu-jima</answer><answer>http://dbpedia.org/resource/Okidait%C5%8Djima</answer><answer>http://dbpedia.org/resource/Udone-shima</answer><answer>http://dbpedia.org/resource/Kozukumi_Island</answer><answer>http://dbpedia.org/resource/Miyako-jima</answer><answer>http://dbpedia.org/resource/Oshima,_Hokkaido</answer><answer>http://dbpedia.org/resource/Yokoate-jima</answer><answer>http://dbpedia.org/resource/Kamome_Island</answer><answer>http://dbpedia.org/resource/Daikon_Island</answer><answer>http://dbpedia.org/resource/Kuroshima_(Kagoshima)</answer><answer>http://dbpedia.org/resource/Dait%C5%8D_Islands</answer><answer>http://dbpedia.org/resource/I%C5%8Djima_(Kagoshima)</answer><answer>http://dbpedia.org/resource/Lot's_Wife_(crag)</answer><answer>http://dbpedia.org/resource/Okushiri_Island</answer><answer>http://dbpedia.org/resource/Benten-jima_(Wakkanai)</answer><answer>http://dbpedia.org/resource/Smith_Island_(Japan)</answer><answer>http://dbpedia.org/resource/Amami_Islands</answer><answer>http://dbpedia.org/resource/Hachij%C5%8D-kojima</answer><answer>http://dbpedia.org/resource/Kojima_(Hokkaido)</answer><answer>http://dbpedia.org/resource/Rebun_Island</answer><answer>http://dbpedia.org/resource/Tokashiki_Island</answer><answer>http://dbpedia.org/resource/Iejima</answer><answer>http://dbpedia.org/resource/Sh%C5%8Dwa_I%C5%8Djima</answer><answer>http://dbpedia.org/resource/Jinai-t%C5%8D</answer><answer>http://dbpedia.org/resource/Tsuken_Island</answer><answer>http://dbpedia.org/resource/Denshima</answer><answer>http://dbpedia.org/resource/Hokkaido__island__1</answer></answers></query>

<query id="29">
<keyword_query lang="en"><![CDATA[ruling party in Lisbon]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        Lisbon rulingParty ?uri . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Lisbon dbp:leaderParty ?uri . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Socialist_Party_(Portugal)</answer></answers></query>

