<?xml version="1.0"?>
<dataset id="qald-5_train">

<query id="30">
<keyword_query lang="en"><![CDATA[Apollo 14 astronauts]]></keyword_query>
<schema_agnostic_query><![CDATA[ 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri type Apollo14Astronauts . 
} 
]]>
</schema_agnostic_query>
<resolved_query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:mission res:Apollo_14 . 
} 
]]>
</resolved_query>
<answers><answer>http://dbpedia.org/resource/Alan_Shepard</answer><answer>http://dbpedia.org/resource/Edgar_Mitchell</answer><answer>http://dbpedia.org/resource/Stuart_Roosa</answer></answers></query>

</dataset>
